#1
цена_товара = 2500
скидка_процентов = 15
скидка_в_рублях = цена_товара * (скидка_процентов / 100)
Цена_со_скидкой = (цена_товара-скидка_в_рублях)
print("Цена со скидкой:", Цена_со_скидкой)
# Цена со скидкой: 2125.0 

#2
print("Лучшее время:",min(32,27,41))
# Лучшее время: 27

#3
имя = 'Готбрех'
print(имя*3)
print("Имя:",имя,'.', " Уровень: 1", sep="")
# ГотбрехГотбрехГотбрех
# Имя:Готбрех. Уровень: 1

#4
a=10/3
b=10/6
c=10/7
print(round(a), round(b), round(c))
print("10/3=",a,"-->", round(a), sep="", end=", ")
print("10/6=",b,"-->", round(b), sep="", end=", ")
print("10/7=",c,"-->", round(c), sep="")
#3 2 1
# 10/3=3.3333333333333335-->3, 10/6=1.6666666666666667-->2, 10/7=1.4285714285714286-->1

#5
hp_max = 100
damage = 34
current_hp = hp_max-damage
current_hp_percent=current_hp/hp_max*100
заполнено = round(current_hp_percent/10)
пусто = 10-заполнено
бары = "█" * заполнено + "░" * пусто
print("HP: [", бары, "] ", current_hp, "/", hp_max, sep="")
# HP: [███████░░░] 66/100